load-tests/scenario3-crud.yml
# 시나리오 3: 일정 CRUD 동시 실행 부하테스트
# DB 트랜잭션 경합 및 동시 쓰기 부하 확인
config:
  target: "http://localhost:8080"
  phases:
    - duration: 10
      arrivalRate: 3
      name: "Warm up (3 req/s)"
    - duration: 20
      arrivalRate: 10
      name: "Sustained load (10 req/s)"
    - duration: 10
      arrivalRate: 20
      name: "Peak load (20 req/s)"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create, read, update, delete events"
    flow:
      # 로그인
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "test@test.com"
            password: "test1234"
          capture:
            - json: "$.token"
              as: "token"
      # 일정 생성
      - post:
          url: "/api/v1/events"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "부하테스트 일정 {{ $randomNumber(1, 9999) }}"
            content: "Artillery 부하테스트로 생성된 일정입니다"
            startAt: "2026-02-20T09:00:00"
            endAt: "2026-02-20T10:00:00"
            isRecurring: false
            alert: "none"
          capture:
            - json: "$.data.event.id"
              as: "eventId"
          expect:
            - statusCode: 201
      # 일정 조회
      - get:
          url: "/api/v1/events/{{ eventId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      # 일정 수정
      - put:
          url: "/api/v1/events/{{ eventId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "수정됨 - 부하테스트 일정"
            content: "수정된 내용입니다"
            startAt: "2026-02-20T10:00:00"
            endAt: "2026-02-20T11:00:00"
          expect:
            - statusCode: 200
      # 일정 삭제
      - delete:
          url: "/api/v1/events/{{ eventId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200